<!DOCTYPE html>
<html>
<head>
	<title>sakura</title>
</head>
<body>
<?php 
	
$ar=[["книга 1","1900"], ["книга 2","1910"]];


$arr=[ 
		 ['name' =>'Борис Акунин','email'=>'borisakunin@gmail.com','born'=>'1956','books'=>[['Азазель','1998'],['Турецкий гамбит','1998'],['Левиафан','1998'],['Смерть Ахиллеса','1998'],['Особые поручения','1999'],['Пиковый валет','1999'],['Декоратор','1999'],['Статский советник','1999'],['Коронация','2000'],['Любовница смерти','2001'],['Любовник смерти','2001'],['Алмазная колесница','2002'],['Нефритовые четки','2006'],['Весь мир театр','2009'],['Черный город','2012'],['Планета Вода','2015'],['Не прощаюсь','2018']]],
		 ['name' =>'Михаил Афанасьевич Булгаков','email'=>'bulgakov@yandex.ru','born'=>'1891','books'=>[['Мастер и Маргарита','1928'],['Жизнь господина де Мольера','1962'],['Собачье сердце','1925'],['Тайному другу','1987'],['Похождения Чичикова','1922'],['Белая гвардия','1924']]],
		 ['name' =>'Федор Михайлович Достоевский','email'=>'fedordostoevcki@mail.ru','born'=>'1821','books'=>[['Преступление и наказание','1866'],['Братья Карамазовы','1878'],['Идиот','1869'],['Подросток','1874'],['Белые ночи','1848']]],
		 ['name' =>'Александр Сергеевич Пушкин','email'=>'pushkin@gmail.com','born'=>'1799','books'=>[['Евгений Онегин','1823'],['Руслан и Людмила','1820'],['Медный всадник','1833'],['Пиковая дама','1834'],['Капитанская дочка','1836'],['Сказка о рыбаке и рыбке','1833']]]
	 ];

for ($i=0; $i < count($arr); $i++) 
{
 	echo "Автор: ".$arr[$i]['name'];
	echo " - Email: ".$arr[$i]['email'];
	echo " - Год рождения: ".$arr[$i]['born']."<br>";
}
echo "____________________________________________________________________________________<br><br>";
for ($i=0; $i < count($arr); $i++) 
{
	for ($j=0; $j < count($arr[$i]['books']); $j++)
	{
		echo "Книга: ".$arr[$i]['books'][$j][0]." - ";		
		echo "Автор: ".$arr[$i]['name']." - ";
		echo "Год выпуска книги: ".$arr[$i]['books'][$j][1]."<br>";
	}
}

?>
</body>
</html>